Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དྲན་པ་འཐོབ་པ་ཞེས་བྱ་བའི་རྩི་ཡོད་དེ། དེ་བཅངས་ན་སེམས་ཀྱི་དྲན་པ་རྣམ་པར་དག་པར་འགྱུར་རོ། །དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་དྲན་པ་འཐོབ་པར་བྱེད་པའི་རྩི་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པའི་དྲན་པ་རྣམ་པར་དག་པར་བྱེད་དོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ།
en: “Noble one, just as possessing the potion called attainment of memory purifies the mind’s memory, in the same way, the attainment of memory potion of the aspiration to omniscience purifies for bodhisattvas the unobscured memory of all the Dharma of the buddhas.

source: དཔེར་ན། པད་མ་ཆེན་པོ་ཞེས་བྱ་བའི་རྩི་ཡོད་དེ། དེ་ཟོས་བ་ཙམ་གྱིས་ཚེའི་ཚད་བསྐལ་པར་འགྱུར་རོ། །དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་པད་མོ་ཆེན་པོའི་རྩི་ཟོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་བསྐལ་པ་གྲངས་མེད་པའི་ཚེ་ལ་དབང་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐོབ་པར་འགྱུར་རོ། །
en: “Noble one, just as when someone possesses the potion called great lotus their lifespan is extended to a kalpa by consuming it, in the same way, the bodhisattva who consumes the great lotus potion of the aspiration to enlightenment attains the perfection of power over lifetimes of countless kalpas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། མི་སྣང་བ་ཞེས་བྱ་བའི་རྩི་ཡོད་དེ། དེ་བཅངས་ན་མི་དང་མི་མ་ཡིན་པ་ཐམས་ཅད་ཀྱིས་མི་མཐོང་ངོ་། །དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་རྩི་མི་སྣང་བར་འགྱུར་བ་བཅངས་ཏེ་འདྲེས་པ་རྣམ་པར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་དུ་མི་སྣང་ངོ་། །
en: “Noble one, just as someone who possesses the potion called invisibility cannot be seen by humans or nonhumans while carrying it, in the same way, the bodhisattva whose activity possesses and blends with the invisibility potion of the aspiration to enlightenment is invisible in the scope of perception of the māras.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྒྱ་མཚོ་ཆེན་པོའི་ནང་ན་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཆེན་པོ་རིན་པོ་ཆེ་ཐམས་ཅད་ཡོངས་སུ་སྡུད་པ་ཞེས་བྱ་བ་ཡོད་དེ། དེ་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དུ་མ་འཕོས་ན་རྒྱ་མཚོ་ཆེན་པོ་ལ་བསྐལ་པས་ཚིག་པའི་མེ་ཐམས་ཅད་ཀྱིས་ཀྱང་ཏལ་ཙམ་ཡང་བསྐམ་པར་ནུས་པའི་གནས་མེད་སྐབས་མྱེད་དོ། །
en: “Noble one, if the accumulation of all jewels, which is the name of the great king of precious jewels within the great ocean, does not leave for another world realm, then even all the incinerating fires at the end of a kalpa will be unable to dry up the great ocean, even to the depth of a palm tree.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་ནོར་བུ་རིན་པོ་ཆེ་ཐམས་ཅད་ཡོངས་སུ་སྡུད་པའི་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཆེན་པོ་བསམ་པ་དང་། སེམས་ཀྱི་རྒྱུད་ལ་ཡོད་པ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་བསྔོས་པ་འགའ་ཞིག་རྣམ་པར་ཆུད་ཟ་བར་འགྱུར་བ་དེ་ལྟ་བུའི་གནས་མེད་སྐབས་མེད་དེ།
en: In the same way, for the bodhisattvas who have within their thoughts and the continuum of their minds that great king of precious jewels, the accumulation of all jewels, there will be no situation and no time when even one of all their roots of merit that have been dedicated to omniscience will be lost.

source: དེ་ནི་མི་སྲིད་དེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་ཡོངས་སུ་བཏང་བ་ཞིག་ཏུ་གྱུར་ན་ནི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱང་བསྐམ་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: It would be impossible, as all the roots of merit dedicated to the development of the aspiration to omniscience will never dry up.

source: ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་འོད་ཐམས་ཅད་ཡོངས་སུ་འདུས་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Noble one, there is the great precious jewel called the gathering of all light.

source: དེ་མགུལ་དུ་བཏགས་ན་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱན་ཐམས་ཅད་ཀྱང་ཟིལ་གྱིས་ནོན་པར་འགྱུར་རོ། །
en: If that is worn at the throat, it will outshine all other precious jewelry.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱི་སེམས་འོད་ཐམས་ཅད་ཡོངས་སུ་འདུས་པའི་རིན་པོ་ཆེ་ཆེན་པོ་བསམ་པའི་རྒྱན་དུ་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཉན་ཐོས་དང་རང་སངས་རྒྱས་སུ་སེམས་བསྐྱེད་པའི་རིན་པོ་ཆེའི་རྒྱན་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཏོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, if the gathering of all light great precious jewel of the aspiration to enlightenment is worn by a bodhisattva as an adorning aspiration, it will outshine all the precious jewelry that is the development of the aspirations to become a śrāvaka or a pratyeka­buddha.

source: ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཆུ་འདང་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Noble one, there is the great precious jewel called pure water.

source: དེ་ཆུར་བཅུག་ན་འདམ་དང་རྙོག་པ་ཐམས་ཅད་རབ་ཏུ་དང་བར་བྱེད་དོ། །
en: If it is placed in water, it becomes clear of all mud and pollution.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱི་སེམས་ཆུ་འདང་གི་ནོར་བུ་རིན་པོ་ཆེ་ཡང་ཉོན་མོངས་པའི་འདམ་དང་། རྙོག་པ་ཐམས་ཅད་རབ་ཏུ་དང་བར་བྱེད་དོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, the great precious pure water jewel of the aspiration to enlightenment clears away the mud and pollution of the kleśas.

source: ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཆུ་དང་འགྲོགས་པ་ཞེས་བྱ་བ་ཐོགས་པའི་ཉ་པ་ནི་ཆུར་མི་འཆིའོ། །
en: “Noble one, there is the great precious jewel called being with water. A fisherman who wears it will not drown in the water.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་ཆུ་དང་འགྲོག་པའི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་འཁོར་བའི་རྒྱ་མཚོ་ཐམས་ཅད་དུ་མི་འཆིའོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, the bodhisattva who wears the great precious being with water jewel of the aspiration to omniscience will not drown in all the oceans of saṃsāra.

source: ནོར་བུ་རིན་པོ་ཆེ་ཀླུའི་ནོར་བུའི་གོ་ཆ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Noble one, there is the great precious jewel called nāga jewel armor.

source: དེ་ལག་ན་འདུག་ན་ཉ་བ་ལ་སྩོགས་པ། ཆུ་ལས་འཚོ་བ་རྣམས་ཀླུའི་གནས་ཐམས་ཅད་དུ་འདོང་ཡང་ཀླུའི་སྦྲུལ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་སོ། །
en: If fishermen and all those who make their living from the water hold it in their hands, they will not be attacked by snakes even if they enter all abodes of the nāgas.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་ཡེ་ཤེས་ཀླུའི་ནོར་བུའི་གོ་ཅ་འཆང་བའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་འདོད་པའི་གནས་ཀྱི་ཁམས་ཐམས་ཅད་དུ་འགྲོ་བ་ཡང་ཉམས་པར་མི་འགྱུར་རོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, the bodhisattva who wears the great precious nāga jewel armor of the aspiration to omniscience, even if entering all the abodes of the realm of desire, will not be impaired.

source: ནོར་བུ་རིན་པོ་ཆེ་བརྒྱ་བྱིན་མངོན་པར་ཆགས་པ་ཐོགས་པའི་ལྷའི་རྒྱལ་པོ་བརྒྱ་བྱིན་ནི། ལྷའི་ཚོགས་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཏོ། །
en: “Noble one, Śakra, the king of the devas, who wears the great precious jewel called attached to Śakra, outshines the host of devas.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་བརྒྱ་བྱིན་མངོན་པར་ཆགས་པའི་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཆེན་པོ་སྨོན་ལམ་གྱི་ཅོད་པན་མགོ་ལ་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཁམས་གསུམ་པ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཏོ། །
en: In the same way, the bodhisattva who wears as a crown of prayer the great precious attached to Śakra jewel of the aspiration to omniscience outshines all the three realms.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཡིད་བཞིན་གྱི་རྒྱལ་པོ་ཐོགས་པའི་མི་ནི་ཕོངས་པ་ཐམས་ཅད་ཀྱིས་མི་འཇིགས་སོ། །
en: “Noble one, a human who wears the great precious jewel called the king of wish fulfillment has no fear of poverty.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་ཡིད་བཞིན་གྱི་རྒྱལ་པོའི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཡོ་བྱད་དང་འཚོ་བས་བག་ཚ་བ་ཐམས་ཅད་ཀྱིས་མི་འཇིགས་སོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, the bodhisattva who wears the great precious king of wish fulfillment jewel of the development of the aspiration to omniscience has no fear concerning necessities and livelihood.

source: ནོར་བུ་རིན་པོ་ཆེ་ཉི་མས་མཛེས་པ་ནི་ཉི་མ་ལ་བསྟན་ན་མི་འབྱུང་ངོ་། །
en: “Noble one, if one faces the great precious jewel called beautified by the sun toward the sun, fire will arise.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་ཉི་མས་མཛེས་པའི་ནོར་བུ་རིན་པོ་ཆེ་ཡང་ཤེས་རབ་ཀྱི་འོད་ཟེར་གྱིས་ཕོག་ན་ཡེ་ཤེས་ཀྱི་མེ་འབྱིན་ཏོ། །
en: In the same way, if the light rays of wisdom strike the great precious beautified by the sun jewel of the development of the aspiration to omniscience, it will emit the fire of wisdom.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ནོར་བུ་རིན་པོ་ཆེ་ཟླ་བས་མཛེས་པ་ཞེས་བྱ་བ་ལ་ཟླ་བའི་འོད་ཀྱིས་ཕོག་ན་ཆུའི་རྒྱུན་འབྱིན་ཏོ། །
en: “Noble one, if moonlight strikes the great precious jewel called beautified by the moon, it will emit a flow of water.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ཟླ་བས་མཛེས་པའི་རིན་པོ་ཆེ་ཆེན་པོ་ཡང་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྔོས་པའི་ཟླ་བའི་འོད་ཀྱིས་ཕོག་ན་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱི་ཆུའི་རྒྱུན་འབྱིན་ཏོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, if the light rays of the dedication of roots of merit strike the great precious beautified by the moon jewel of the development of the aspiration to enlightenment, it will emit a flow of the water of the prayers of all roots of merit.

source: ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོའི་ཅོད་པན་ཐོགས་པའི་ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་རྣམས་ལ་གཞན་གྱི་གནོད་པར་བྱ་བའི་འཇིགས་པ་མེད་དོ། །
en: “Noble one, the great nāga kings who wear the great precious jewel called the king of wish fulfillment as a crest adornment have no fear of harm from others.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱི་སེམས་སྙིང་རྗེ་ཆེན་པོའི་ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོ་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལའང་ངན་སོང་དང་ངན་འགྲོས་གནོད་པར་བྱ་བའི་འཇིགས་པ་མེད་དོ། །
en: In the same way, the bodhisattvas who wear the great precious king of wish fulfillment jewel of the great compassion of the development of the aspiration to enlightenment have no fear of harm from lower existences, the bad existences.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་འགྲོ་བའི་རྒྱན་དམ་པ་ཞེས་བྱ་བ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བས་ནམ་ཡང་བྱང་བར་མི་འགྱུར་རོ། །
en: “Noble one, the great precious jewel called the excellentarray of beings fulfills the wishes of all beings without ever ceasing to do so.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་རྒྱན་གྱི་དམ་པའི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱ་བས་ནམ་ཡང་བྱང་བར་མི་འགྱུར་རོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, the great precious excellent array of beings jewel of the development of the aspiration to enlightenment fulfills the wishes of all beings and the prayers of bodhisattvas without ever ceasing to do so.

source: རྒྱལ་པོ་འཁོར་ལོས་སྒྱུར་བའི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ནི་མུན་པ་ཐམས་ཅད་ཡོངས་སུ་སེལ་ཅིང་འགྲོ་སྟེ། ཁྱིམ་གྱི་ནང་ན་གནས་ན་ཡང་རབ་ཏུ་སྣང་བར་བྱེད་དོ། །
en: “Noble one, the great precious jewel of a cakravartin dispels all darkness wherever it is present, illuminating even those dwelling in the middle of the harem quarters.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་འཁོར་ལོས་སྒྱུར་བའི་ནོར་བུ་རིན་པོ་ཆེ་ཡང་མ་རིག་པའི་མུན་པ་ཐམས་ཅད་སེལ་ཅིང་འགྲོ་བའི་རྒྱུད་ཐམས་ཅད་དུ་འགྲོ་སྟེ། འདོད་པའི་ཁམས་ན་གནས་ན་ཡང་ཡེ་ཤེས་ཀྱི་སྣང་བ་ཆེན་པོར་རབ་ཏུ་འགྱེད་དོ། །
en: In the same way, the great, precious cakravartin jewel of the development of the aspiration to omniscience dispels all darkness of ignorance within all the classes of beings, spreading the great light of wisdom even to those dwelling in the desire realm.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། གང་ཅི་ཡང་རུང་སྟེ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཨིན་དྲ་ནཱི་ལའི་འོད་ཀྱིས་ཕོག་པ་དེ་དག་ཐམས་ཅད་ནི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཨིནྡྲ་ནཱི་ལའི་ཁ་དོག་ཏུ་འགྱུར་རོ། །
en: “Noble one, whatever is struck by the light of the great precious sapphire jewel is transformed into the color of the great precious sapphire jewel.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཨིན་དྲ་ནཱི་ལ་ཡང་ཆོས་གང་དང་གང་ལ་རྣམ་པར་སྤྱད་པ་དང་། ཡོངས་སུ་བཏང་བ་དང་། དགེ་བའི་རྩ་བ་གང་ཅི་ཡང་རུང་སྟེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པས་ཡོངས་སུ་བསྔོས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་ཁ་དོག་ཏུ་འགྱུར་རོ། །
en: In the same way, in whatever Dharma the great precious sapphire jewel of the development of the aspiration to omniscience is practiced, whatever it is directed toward, and whatever root of merit is dedicated by the development of the aspiration to omniscience, they all become transformed into the color of the great precious sapphire jewel of the development of the aspiration to omniscience.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ནོར་བུ་རིན་པོ་ཆེ་བཻཌཱུརྱ་ནི་ལོ་བརྒྱ་ཕྲག་སྟོང་དུ་མི་གཙང་བའི་ནད་ཞིག་ན་འདུག་ཀྱང་དྲི་མི་ཞིམ་པ་ཐམས་ཅད་དང་ལྷན་ཅིག་མི་གནས་ཏེ།
en: “Noble one, even though the precious beryl jewel remains for a hundred thousand years among impurities, it will not become associated with their unpleasant smell.

source: དེའི་རང་བཞིན་འོད་གསལ་བ་ནི་དེ་བཞིན་དུ་གསལ་ཞིང་ཤིན་ཏུ་དྲི་མ་མེད་དོ། །
en: Its bright nature remains in that way clear and unstained.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་ནོར་བུ་རིན་པོ་ཆེ་བཻཌཱུརྱ་ཡང་བསྐལ་པ་བརྒྱ་ཕྲག་སྟོང་ཞིག་ཏུ་འདོད་པའི་ཁམས་ཐམས་ཅད་དུ་གནས་ཀྱང་འདོད་པའི་ཁམས་ཀྱི་སྐྱོན་ཐམས་ཅད་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པར་མི་འགྱུར་ཏེ།
en: In the same way, even though the precious beryl jewel of the development of the aspiration to omniscience remains for a hundred thousand years within all desire realms, it will not become afflicted by any of the faults of the desire realm.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་རང་བཞིན་འོད་གསལ་བ་ནི་དེ་བཞིན་དུ་ཤིན་ཏུ་དག་པར་གནས་སོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: The bright nature of the realm of the Dharma will remain pure in that way.

source: ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པས་རྣམ་པར་དག་པའི་འོད་ཅེས་བྱ་བ་ནི་རིན་པོ་ཆེའི་འབྱུང་གནས་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཏོ། །
en: “Noble one, the great precious jewel called stainless pure light outshines all sources of jewels.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པས་རྣམ་པར་དག་པའི་འོད་ཀྱང་སོ་སོའི་སྐྱེ་བོ་དང་། སློབ་པ་དང་མི་སློབ་པ་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་རིན་པོ་ཆེའི་འབྱུང་གནས་ཟིལ་གྱིས་གནོན་ཏོ། །
en: In the same way, the great precious stainless pure light jewel of the development of the aspiration to omniscience outshines the source of the jewels of the qualities of ordinary beings, of training and trained śrāvakas, and of pratyeka­buddhas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རིན་པོ་ཆེ་ཆེན་པོ་མེ་འབྱུང་བ་ཞེས་བྱ་བ་ནི་གཅིག་པུ་གནས་ཀྱང་མུན་པ་ཐམས་ཅད་རྣམ་པར་སེལ་ཏོ། །
en: “Noble one, a single great precious jewel called the arising of fire can dispel all darkness.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་ནོར་བུ་རིན་པོ་ཆེ་མེ་འབྱུང་བ་ལྷག་མཐོང་དང་ལྡན་པ་གཅིག་པུ་ཡང་ཚུལ་བཞིན་ཡིད་ལ་བྱ་བས་མི་ཤེས་པའི་མུན་པ་ཐམས་ཅད་རྣམ་པར་སེལ་ཏོ། །
en: In the same way, a single great precious arising of fire jewel of the development of the aspiration to omniscience that is endowed with vipaśyanā will through its correct mentation dispel all the darkness of ignorance.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྒྱ་མཚོ་ཆེན་པོ་ནས་གྲུས་བླངས་པའི་ནོར་བུ་རིན་པོ་ཆེ་རིན་ཐང་མེད་པ་ཚོང་པའི་ལག་དུ་འོང་བ་ནི་གྲོང་ཁྱེར་དུ་ཕྱིན་ན་ནོར་བུ་འཆིང་བུ་བརྒྱ་ཕྲག་སྟོང་ཡང་ཁ་དོག་དང་རིན་ཐང་གིས་ཟིལ་གྱིས་གནོན་ཏོ། །
en: “Noble one, when a priceless precious jewel taken from the great ocean by a ship comes into the hands of a merchant and he goes into the city, it outshines even a hundred thousand pieces of glass jewelry.

source: དེ་བཞིན་དུ་འཁོར་བའི་རྒྱ་མཚོ་ཆེན་པོ་ན་གནས་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་རིན་ཐང་མེད་པ་སྨོན་ལམ་གྱི་གྲུར་བཅུག་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དང་པོ་བསྐྱེད་པས་ལྷག་པའི་བསམ་པའི་རྒྱུད་ལ་འདུག་སྟེ་ཐམས་ཅད་མཁྱེན་པའི་གྲོང་ཁྱེར་དུ་མ་ཕྱིན་ཀྱང་རྣམ་པར་གྲོལ་བའི་གྲོང་ཁྱེར་དུ་ཕྱིན་ན་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ནོར་བུ་འཆིང་བུ་ལྟ་བུ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཏོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, although the priceless great precious jewel of the development of the aspiration to omniscience is within the great ocean of saṃsāra, it is brought onto the ship of prayer. Bodhisattvas who have the higher aspiration from having developed for the first time the aspiration for enlightenment, even though they have not reached the city of omniscience, when they enter the city of liberation, they outshine all the śrāvakas and pratyeka­buddhas, who are like jewelry made of glass.

source: ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དབང་གི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Noble one, there is the great precious jewel called the king of power.

source: དེ་ནི་འཛམ་བུའི་གླིང་ན་གནས་ཀྱང་དཔག་ཚད་སྟོང་ཕྲག་བཞི་བཅུ་ན་གནས་པའི་གཉི་ཟླའི་དཀྱིལ་འཁོར་གྱི་ཁྱིམ་གྱི་གཞལ་མེད་ཁང་གི་གཟུགས་བརྙན་གྱི་རྒྱན་ཡོངས་སུ་སྟོན་ཏོ། །
en: Even though it is located in Jambudvīpa, it manifests the reflections of the divine palaces that are the disks of the sun and moon, which are forty thousand yojanas distant.

source: དེ་བཞིན་དུ་ཡོན་ཏན་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་སྦྱངས་པའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དབང་གི་རྒྱལ་པོ་ཡང་འཁོར་བའི་གནས་ན་འདུག་བཞིན་དུ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ནམ་མཁའི་སྤྱོད་ཡུལ་ལས་རྒྱུ་བའི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཆེན་པོའི་གཉི་ཟླ་དང་སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཀྱི་གཟུགས་བརྙན་གྱི་རྒྱན་ཡོངས་སུ་སྟོན་ཏོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ཇི་སྲིད་དུ་གཉི་ཟླའི་དཀྱིལ་འཁོར་འོད་ཀྱིས་སྣང་བར་བྱེད་པ་དེ་སྲིད་དུ་ནོར་དང་།
en: In the same way, the great precious king of power jewel of the development of the aspiration to omniscience, even while in saṃsāra, manifests the reflections of the sun and moon of the great wisdom of the tathāgatas who move through their range of activity, which is the sky that is the realm of phenomena, and the reflections of all the fields of perception of the buddhas.

source: འབྲུ་དང་། རིན་པོ་ཆེའི་རྣམ་པ་དང་། གསེར་དང་དངུལ་དང་། མྱེ་ཏོག་དང་སྤོས་དང་ཕྲེང་བ་དང་། གོས་དང་ལོངས་སྤྱོད་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དབང་གི་རྒྱལ་པོའི་རིན་དུ་མི་ཆོག་གོ །
en: “Noble one, for as long as the disks of the sun and moon shine, for that long, all the wealth, grain, jewels, gold, silver, flowers, perfumes, garlands, clothes, and possessions there can be cannot all together reach the value of the great precious jewel called the king of power.

source: དེ་བཞིན་དུ་ཇི་སྲིད་དུ་དུས་གསུམ་ལ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཡུལ་སྣང་བར་མཛད་པ་དེ་སྲིད་དུ་ལྷ་དང་མི་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་ཟག་པ་ཡོད་པ་འམ། ཟག་པ་མེད་པ་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དབང་གི་རྒྱལ་པོའི་རིན་དུ་མི་ཆོག་གོ །
en: In the same way, for as long as the wisdom of omniscience illuminates the realm of phenomena in the three times, for that long all the roots of merit, whether defiled or undefiled, of all devas, humans, śrāvakas, and pratyeka­buddhas cannot all together reach the value of the great, precious king of power jewel of the aspiration to enlightenment.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་རྒྱ་མཚོའི་རྒྱན་ཀྱི་དམ་པ་ཞེས་བྱ་བ་ཡོད་དེ། དེ་ནི་རྒྱ་མཚོའི་རྒྱན་ཐམས་ཅད་ཡོངས་སུ་སྟོན་ཏོ། །
en: “Noble one, there is the great precious jewel called the excellenceof the ocean’s display, which reveals the entire display of the ocean.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་རྒྱ་མཚོའི་རྒྱན་གྱི་དམ་པ་ཡང་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་རྒྱ་མཚོའི་རྒྱན་ཐམས་ཅད་ཡོངས་སུ་སྟོན་ཏོ། །
en: In the same way, the great precious excellence of the ocean’s display jewel of the development of the aspiration to enlightenment reveals all the displays of the ocean of the scope of omniscient wisdom.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཡིད་བཞིན་གྱི་རྒྱལ་པོ་མ་གཏོགས་པར་ལྷ་རྫས་ཀྱི་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་ལས་ལྷག་པར་འཕགས་པ་གང་ཡང་མེད་དོ། །
en: “Noble one, except for the great precious jewel called the king of wish-fulfillment, there is nothing that is superior to divine Jambu River gold.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཡིད་བཞིན་གྱི་རྒྱལ་པོ་མ་གཏོགས་པར་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་ལྷ་རྫས་ཀྱི་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་ལས་ལྷག་པར་ཁྱད་པར་དུ་འཕགས་པ་གང་ཡང་མེད་དོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, except for the great precious king of wish-fulfillment jewel of omniscient wisdom, there is nothing that is superior to the divine Jambu River gold of the aspiration to enlightenment.

source: ཀླུའི་ཚོགས་གྲུབ་པར་གྱུར་པའི་སྦྲུལ་འདུལ་བ་ནི་ཀླུ་དང་སྦྲུལ་ཐམས་ཅད་ལ་དབང་བསྒྱུར་རོ། །
en: “Noble one, a snake tamer who has the accomplishment of the hosts of nāgas has power over nāgas and snakes.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་ནན་ཏན་གྱི་ཀླུའི་དཀྱིལ་འཁོར་གྲུབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སྦྲུལ་འདུལ་བ་ཡང་ཉོན་མོངས་པའི་ཀླུ་དང་། སྦྲུལ་ཐམས་ཅད་ལ་དབང་བསྒྱུར་རོ། །
en: In the same way, the snake-tamer bodhisattva who has the accomplishment of the hosts of nāgas, which is the practice of the development of the aspiration to omniscience, has power over all the nāgas and snakes of the kleśas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། དཔའ་བོ་ལག་ཆ་དང་ལྡན་པ་ནི་དགྲའི་འཁོར་གྱིས་ཚུགས་པར་དཀའོ། །
en: “Noble one, a hero with weapons is difficult for the host of enemies to harm.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་ལག་ཆ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱང་ཉོན་མོངས་པའི་དགྲའི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཀྱིས་ཐུབ་པར་དཀའོ། །
en: In the same way, all bodhisattvas who have the weapons of the development of the aspiration to omniscience cannot be harmed by all the hosts of enemies who are the kleśas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ལྷ་རྫས་ཀྱི་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་ཕྱེ་མ་སྲང་གཅིག་གིས་ནི་སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་དྲི་ཞིམ་པོས་རྒྱས་པར་འགེངས་ཏེ་དེ་ཞོ་གཅིག་ཙམ་ལ་ཡང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེས་ཡོངས་སུ་གང་བ་རིན་དུ་མི་ཆོག་གོ །
en: “Noble one, one dharaṇa of divine uragasāra sandalwood powder will fill a thousand worlds with a lovely aroma, so that even jewels that could fill a billion-world universe would not reach the value of one karṣa of divine uragasāra sandalwood powder.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་ལྷ་རྫས་ཀྱི་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོས་ལྷག་པའི་བསམ་པ་གཅིག་ལ་གནས་པའི་ཁམས་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ཡོན་ཏན་གྱི་དྲི་ཞིམ་པོར་རྒྱས་པར་འགེངས་ཏེ་སློབ་པ་དང་མི་སློབ་པ་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སེམས་ཀྱང་ཟིལ་གྱིས་གནོན་ཏོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, a single instance of the superior aspiration that is the divine uragasāra sandalwood of the development of the aspiration to omniscience will pervade the entire realm of phenomena with the lovely aroma of good qualities, and therefore it outshines the aspirations of all training śrāvakas and accomplished śrāvakas and of pratyeka­buddhas.

source: ཙན་དན་རིན་པོ་ཆེ་ཆེན་པོ་ཁ་བའི་ཙན་དན་ཞེས་བྱ་བ་ནི་གདུང་བ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་དེ། ལུས་ཐམས་ཅད་ཀྱང་རབ་ཏུ་བསལ་བར་བྱེད་དོ། །
en: “Noble one, precious Himalayan sandalwood will pacify all torment and cool the entire body.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་ཁ་བའི་ཙན་དན་རིན་པོ་ཆེ་ཡང་ཉོན་མོངས་པའི་ཀུན་ཏུ་རྟོག་པ་དང་། འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་གིས་གདུང་བ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་སེལ་ཏོ། །ཡེ་ཤེས་ཀྱི་ལུས་ཀྱང་རབ་ཏུ་སིམ་པར་བྱེད་དོ། །
en: In the same way, the precious Himalayan sandalwood of the development of the aspiration to omniscience will dispel all the torment from the conceptualization, desire, anger, and ignorance of the kleśas and will refresh the body of wisdom.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རིའི་རྒྱལ་པོ་རི་རབ་ཀྱི་དྲུང་དུ་ཇི་སྙེད་ཅིག་ཉེ་བར་འདོད་པ་དེ་དག་ཐམས་ཅད་གསེར་གྱི་ཁ་དོག་གཅིག་ཏུ་འགྱུར་རོ། །
en: “Noble one, all who approach Sumeru, the king of mountains, become the same color as its golden color.

source: དེ་བཞིན་དུ་གང་སུ་ཡང་རུང་སྟེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་དྲུང་དུ་ཉེ་བར་འོངས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཁ་དོག་ཏུ་ཁ་དོག་གཅིག་པར་འགྱུར་རོ། །
en: In the same way, whoever approaches the development of the aspiration to omniscience will become the same color as the color of omniscience.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ཤིང་སུས་ཀྱང་མི་ཚུགས་པ་དང་། ཀུན་ནས་འདུ་བའི་ཤུན་ཕྲགས་ཀྱི་དྲི་ཞིམ་པོ་འབྱུང་བ་དེ་ལྟ་བུ་ནི་འཛམ་བུ་གླིང་གི་མེ་ཏོག་པར་ཤི་ཀ་དང་། མེ་ཏོག་ཛ་ཏི་དང་། མེ་ཏོག་སུ་མ་ན་ལ་སྩོགས་པ་མེ་ཏོག་གི་རྣམ་པ་ཐམས་ཅད་ལ་ཡང་མེད་དོ། །
en: “Noble one, the kind of lovely aroma that comes from the bark of the divine coral tree and orchid tree is not found among the gardenia, royal jasmine, jasmine, and the other flowers of Jambudvīpa.
